In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [42]:
df1=DataFrame(np.arange(8).reshape(2,4),index=pd.Index(['Ik','Uy'],name='City'),columns=pd.Index(['A','B','C','D'],name='Letter'))
df1

Letter  A  B  C  D
City
Ik      0  1  2  3
Uy      4  5  6  7

In [43]:
df1.stack()

City  Letter
Ik    A         0
      B         1
      C         2
      D         3
Uy    A         4
      B         5
      C         6
      D         7
dtype: int32

In [44]:
df2=df1.unstack()
df2

Letter  City
A       Ik      0
        Uy      4
B       Ik      1
        Uy      5
C       Ik      2
        Uy      6
D       Ik      3
        Uy      7
dtype: int32

In [45]:
df2.unstack()

City    Ik  Uy
Letter
A        0   4
B        1   5
C        2   6
D        3   7

In [15]:
s1= Series([3,4,8,6,7], index=['A','C','E','F','G'])
s1

A    3
C    4
E    8
F    6
G    7
dtype: int64

In [17]:
s2=Series([8,7,11,56,98],index=['A','B','C','E','F'])
s2

A     8
B     7
C    11
E    56
F    98
dtype: int64

In [32]:
df3=pd.concat([s1,s2],keys=(['One','Two']))
df3

One  A     3
     C     4
     E     8
     F     6
     G     7
Two  A     8
     B     7
     C    11
     E    56
     F    98
dtype: int64

In [33]:
df4= df3.unstack()
df4

       A    B     C     E     F    G
One  3.0  NaN   4.0   8.0   6.0  7.0
Two  8.0  7.0  11.0  56.0  98.0  NaN

In [34]:
df4.stack(dropna=False)

One  A     3.0
     B     NaN
     C     4.0
     E     8.0
     F     6.0
     G     7.0
Two  A     8.0
     B     7.0
     C    11.0
     E    56.0
     F    98.0
     G     NaN
dtype: float64

In [26]:
df3.unstack()

A  One     3.0
   Two     8.0
B  One     NaN
   Two     7.0
C  One     4.0
   Two    11.0
E  One     8.0
   Two    56.0
F  One     6.0
   Two    98.0
G  One     7.0
   Two     NaN
dtype: float64

In [35]:
df4.stack()

One  A     3.0
     C     4.0
     E     8.0
     F     6.0
     G     7.0
Two  A     8.0
     B     7.0
     C    11.0
     E    56.0
     F    98.0
dtype: float64

In [39]:
df2.unstack()

City  Ik  Uy
A      0   4
B      1   5
C      2   6
D      3   7

In [47]:
df2.unstack('Letter')

Letter  A  B  C  D
City
Ik      0  1  2  3
Uy      4  5  6  7